# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
first = pd.Series(np.random.randint(1, 5, 100))
second = pd.Series(np.random.randint(1, 4, 100))
third = pd.Series(np.random.randint(10000, 30001, 100))

print(first)
print(second)
print(third)

0     1
1     2
2     1
3     3
4     3
     ..
95    1
96    2
97    1
98    1
99    3
Length: 100, dtype: int64
0     2
1     3
2     1
3     3
4     2
     ..
95    2
96    2
97    1
98    2
99    3
Length: 100, dtype: int64
0     12056
1     19047
2     21286
3     27190
4     22692
      ...
95    26851
96    11364
97    23966
98    22770
99    15500
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
dataframe = pd.concat([first, second, third], axis=1)
dataframe

    0  1      2
0   1  2  12056
1   2  3  19047
2   1  1  21286
3   3  3  27190
4   3  2  22692
.. .. ..    ...
95  1  2  26851
96  2  2  11364
97  1  1  23966
98  1  2  22770
99  3  3  15500

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
dataframe.columns = ["bedrs", "bathrs", "price_sqr_meter"]
dataframe

    bedrs  bathrs  price_sqr_meter
0       1       2            12056
1       2       3            19047
2       1       1            21286
3       3       3            27190
4       3       2            22692
..    ...     ...              ...
95      1       2            26851
96      2       2            11364
97      1       1            23966
98      1       2            22770
99      3       3            15500

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [15]:
bigcolumn = pd.concat([first, second, third], axis=0)
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       1
1       2
2       1
3       3
4       3
..    ...
95  26851
96  11364
97  23966
98  22770
99  15500

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [16]:
print(len(bigcolumn))

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [17]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        2
2        1
3        3
4        3
..     ...
295  26851
296  11364
297  23966
298  22770
299  15500

[300 rows x 1 columns]